{
  "mh6obvipqv1g": "一、角色技能1.遍历实体列表节点功能遍历输入实体列表中的每个实体节点参数参数类型参数名类型说明入参实体列表实体列表出参当前实体实体2.播放限时特效节点功能在指定的世界坐标位置播放限时特效节点参数参数类型参数名类型说明入参特效资产配置ID配置ID入参位置三维向量入参旋转三维向量入参缩放倍率浮点数入参是否播放默认音效布尔值3.定点发射投射物节点功能在世界坐标系的指定位置发射本地投射物节点参数参数类型参数名类型说明入参投射物的元件ID元件ID入参创建位置三维向量入参创建旋转三维向量入参追踪目标实体入参投射物阵营阵营4.定点位移节点功能定点位移，从当前位置向目标位置位移可配置位移时长与位移速度，当这二者都比较小时，可能无法位移到目标位置节点参数参数类型参数名类型说明入参位移时长浮点数入参位移衰减时长浮点数入参位移速度浮点数入参位移目标位置三维向量入参碰撞是否终止位移布尔值5.恢复生命值节点功能为目标实体发起一次恢复生命值节点参数参数类型参数名类型说明入参目标实体实体入参恢复量浮点数入参是否忽略恢复调整效果布尔值入参本次治疗的仇恨倍率浮点数入参本次治疗的仇恨增量整数6.镜头朝向检测数据节点功能镜头朝向检测数据，从镜头向出射位置打射线，返回路线上合法目标的旋转与位置节点参数参数类型参数名类型说明入参目标类型枚举入参出射位置三维向量入参最近距离浮点数入参最远距离浮点数出参目标旋转三维向量出参目标位置三维向量7.强制退出瞄准状态节点功能当角色处于瞄准状态是，会强制退出瞄准状态节点参数参数类型参数名类型说明8.设置自身攻击目标节点功能将目标实体设置为自身的攻击目标节点参数参数类型参数名类型说明入参目标实体实体入参是否立即转向布尔值9.特定位置打攻击盒节点功能在世界坐标系的指定位置发起一次攻击盒攻击，可以设置该次攻击的各种参数节点参数参数类型参数名类型说明入参目标阵营筛选枚举入参位置三维向量入参旋转三维向量入参伤害系数浮点数入参伤害增量浮点数入参攻击盒实体类型筛选列表阵营列表入参触发类型枚举入参命中场景特效整数入参攻击盒类型枚举入参攻击盒为长方体时的缩放枚举入参攻击盒为球体时的半径布尔值入参攻击盒为扇形时的高度浮点数入参攻击盒为扇形时的扇角度浮点数入参攻击盒为扇形时的扇半径浮点数入参攻击盒为扇形时的内半径浮点数入参攻击盒为扇形时的检测方向枚举入参攻击层筛选枚举入参攻击标签列表字符串列表入参元素类型枚举入参元素攻击强效浮点数入参打击类型枚举入参攻击类型枚举入参打断值浮点数入参是否是绝对伤害布尔值入参命中特效整数入参受击击退朝向枚举入参是否屏蔽伤害跳字布尔值入参命中场景特效偏移三维向量入参命中场景特效旋转三维向量入参命中场景特效缩放浮点数入参命中特效偏移三维向量入参命中特效旋转三维向量入参命中特效缩放浮点数入参本次攻击的仇恨倍率浮点数入参本次攻击的仇恨增量整数入参受击等级枚举入参命中水平冲量浮点数入参命中垂直冲量浮点数10.添加单位状态节点功能为施加目标添加配置ID对应的单位状态节点参数参数类型参数名类型说明入参施加目标实体入参层数整数入参单位状态配置ID配置ID11.通知服务器节点图节点功能通知服务器节点图，支持携带三个字符串参数该节点运行时可以将逻辑传到服务器节点图上，在服务器节点图上会触发【技能节点调用时】事件节点参数参数类型参数名类型说明入参字符串1字符串入参字符串2字符串入参字符串3字符串12.玩家转向节点功能可以让玩家按照配置的转向模式转向节点参数参数类型参数名类型说明入参转向模式枚举分为先目标后输入、输入朝向、目标朝向、先目标后镜头、镜头朝向、先输入后目标13.玩家转向指定朝向节点功能玩家转向三维向量配置的方向节点参数参数类型参数名类型说明入参朝向三维向量14.修改攻击权重节点功能可以修改当前攻击目标的权重节点参数参数类型参数名类型说明入参当前攻击目标的权重浮点数入参是否强制选一次目标布尔值15.移除单位状态节点功能移除目标实体上指定配置ID对应的单位状态节点参数参数类型参数名类型说明入参移除目标实体入参单位状态配置ID配置ID16.移除指定角色扰动装置节点功能移除指定类型的角色扰动装置节点参数参数类型参数名类型说明入参扰动装置类型枚举分为力场器、弹射器、牵引器17.指定挂接点打攻击盒节点功能对指定挂接点发起一次攻击盒攻击，可以设置该次攻击的各种参数节点参数参数类型参数名类型说明入参目标阵营筛选枚举入参挂接点名称字符串入参挂接点偏移三维向量入参挂接点旋转三维向量入参伤害系数浮点数入参伤害增量浮点数入参攻击盒实体类型筛选列表阵营列表入参触发类型枚举入参命中场景特效整数入参攻击盒类型枚举入参攻击盒为长方体时的缩放枚举入参攻击盒为球体时的半径布尔值入参攻击盒为扇形时的高度浮点数入参攻击盒为扇形时的扇角度浮点数入参攻击盒为扇形时的扇半径浮点数入参攻击盒为扇形时的内半径浮点数入参攻击盒为扇形时的检测方向枚举入参攻击层筛选枚举入参攻击标签列表字符串列表入参元素类型枚举入参元素攻击强效浮点数入参打击类型枚举入参攻击类型枚举入参打断值浮点数入参是否是绝对伤害布尔值入参命中特效整数入参受击击退朝向枚举入参是否屏蔽伤害跳字布尔值入参命中场景特效偏移三维向量入参命中场景特效旋转三维向量入参命中场景特效缩放浮点数入参命中特效偏移三维向量入参命中特效旋转三维向量入参命中特效缩放浮点数入参本次攻击的仇恨倍率浮点数入参本次攻击的仇恨增量整数入参受击等级枚举入参命中水平冲量浮点数入参命中垂直冲量浮点数18.重置技能目标节点功能重置技能目标，重新运行一次技能选取逻辑，选择一个新的目标节点参数参数类型参数名类型说明二、通用1.设置局部变量节点功能设置局部变量的值节点参数参数类型参数名类型说明入参变量名字符串入参变量值泛型2.跳出循环节点功能从有限循环中跳出。出引脚需要与节点【有限循环】的【跳出循环】入参相连节点参数参数类型参数名类型说明3.有限循环节点功能从【循环起始值】开始到【循环终止值】结束，会遍历其中的循环值，每次整数加一。每次循环会执行一次【循环体】后连接的节点逻辑。完成一次完整遍历后，会执行【循环完成】后连接的节点逻辑。可以使用【跳出循环】来提前结束该循环值遍历节点参数参数类型参数名类型说明入参循环起始值整数入参循环终止值整数出参当前循环值整数三、自定义仇恨1.按比例修改指定实体的仇恨值节点功能仅自定义仇恨模式可用按比例修改目标实体在指定仇恨拥有者上的仇恨值节点参数参数类型参数名类型说明入参目标实体实体入参仇恨拥有者实体实体入参修改的仇恨值比例浮点数2.按比例转移指定实体的仇恨值节点功能仅自定义仇恨模式可用将仇恨拥有者上对转移来源实体一定比例的仇恨转移到转移目标实体上节点参数参数类型参数名类型说明入参转移目标实体实体入参转移来源实体实体入参仇恨拥有者实体实体入参转移比例浮点数3.嘲讽目标节点功能仅自定义仇恨模式可用嘲讽者实体嘲讽指定目标实体节点参数参数类型参数名类型说明入参嘲讽者实体实体入参目标实体实体4.将目标实体移除出仇恨列表节点功能仅自定义仇恨模式可用将目标实体移出仇恨拥有者实体的仇恨列表，这可能导致目标实体脱战节点参数参数类型参数名类型说明入参目标实体实体入参仇恨拥有者实体实体5.清空指定实体的仇恨列表节点功能仅自定义仇恨模式可用清空指定实体的仇恨列表，这通常会导致该目标脱战节点参数参数类型参数名类型说明入参目标实体实体6.设置指定实体的仇恨值节点功能仅自定义仇恨模式可用设置指定实体在仇恨拥有者实体上的仇恨值节点参数参数类型参数名类型说明入参目标实体实体入参仇恨拥有者实体实体入参仇恨值整数7.修改指定实体的仇恨值节点功能仅自定义仇恨模式可用修改指定实体在仇恨拥有者实体上的仇恨值节点参数参数类型参数名类型说明入参目标实体实体入参仇恨拥有者实体实体入参仇恨值增量整数"
}