{
  "mh796lr44x0e": "一、角色的击倒与复苏概念在游玩过程中，当玩家的所有角色实体被击倒时（称为玩家所有角色倒下状态），会进入复苏相关流程对于玩家实体和角色实体，有以下的复苏与倒下相关概念角色倒下：角色因生命值降为0或被强制击倒。在超限模式中这同样意味着玩家所有角色倒下（因为玩家仅有一个角色）角色复苏：角色解除倒下状态。当玩家所有角色均处于倒下状态时，任一角色的复苏都会导致该玩家解除倒下状态玩家所有角色倒下：玩家实体自身不可被击倒，但存在玩家所有角色倒下的概念。在超限模式中，玩家所有角色倒下与角色倒下是相同的时点（同上，还是因为玩家只有一个角色）同理，因为玩家实体不可被击倒，所以也不存在复苏玩家实体的概念。二、角色的复苏流程一个超限模式下典型的复苏流程如下所示1、角色因生命值降为0等原因被击倒，角色倒下。此时进入所有角色倒下状态2、复苏界面界面上的功能如下：【放弃挑战】：点击后退出本关卡【（）秒后复苏】/【复苏】：当复苏配置中配置了复苏时间时，在等待复苏时间的秒数后，可以点击【复苏】按键，使角色在复苏点复苏3、点击【复苏】按键、自动复苏或服务端节点图强制复苏后，在复苏点复苏此时生命值为复苏配置中配置的复苏后生命比例（%）三、复苏相关配置1.复苏相关配置入口需要注意的是，复苏相关配置是在【玩家模板】上的，而玩家实体又是由玩家模板生成的，这意味着不同玩家可以有着不同的复苏配置例如：1号玩家有3次复苏的次数限制，而2号玩家没有复苏次数限制，但每次复苏需要等待30秒的时间2.复苏相关配置项配置项说明允许复苏当配置为【否】时，该玩家无法复苏可以通过服务端节点图的【允许/禁止玩家复苏】来动态开关显示复苏界面当配置为【否】时，该玩家倒下后不会弹出复苏界面注意！这意味着这名玩家无法通过游戏的内置逻辑进行复苏，需要为其制作自定义逻辑进行复苏（例如：其他角色协助其复苏等），否则将无法复苏、只能退出当前关卡复苏耗时（s）玩家的复苏时间。玩家倒下后必须等待复苏时间配置的时间后，才可以复苏当配置为【自动复苏】时，会在经过复苏时间的等待后立刻复苏可以通过节点图【设置玩家复苏时间】来调整下一次复苏的时间自动复苏在倒下后，等待【复苏时间】配置的时间后，自动复苏，不需要玩家点击【复苏】按钮复苏次数限制这名玩家的复苏次数限制。当复苏的次数超过复苏次数限制后，无法复苏可以通过节点图【设置玩家剩余复苏次数】节点来调整剩余的复苏次数复苏点列表这名玩家默认的合法复苏点列表。复苏时，会按照【复苏点选取规则】从复苏点列表中选取合法的复苏点进行复苏可以通过节点图【激活复苏点】和【注销复苏点】节点动态调整玩家的合法复苏点列表复苏点选取规则决定了从当前【复苏点列表】中选取复苏点的规则有以下可选项：最近的复苏点：选取距离倒下位置空间距离上最近的合法复苏点最新激活的复苏点：时间上最新激活的复苏点。可以通过激活一个已经激活的复苏点来刷新复苏点的激活时间优先级最高的复苏点：当前合法复苏点列表中优先级最高的复苏点。复苏点优先级可以在复苏点上配置。存在多个同优先级的复苏点时会随机选取一个进行复苏随机复苏点：从当前的合法复苏点列表中随机选取一个作为复苏点进行复苏复苏后生命比例（%）复苏后角色生命值百分比，该值不可为0特殊被击倒损伤-扣除最大生命比例（%）溺水、坠入深渊后扣除的生命值百分比，此类复苏不是常规的复苏流程，也不会扣除复苏次数四、复苏相关功能节点复苏角色节点类型：执行节点功能复苏一个指定角色在超限模式中，与【复苏玩家所有角色】功能相似，会复苏玩家的角色、并解除玩家的所有角色倒下状态。这次复苏不会扣除玩家的复苏次数节点参数参数类型参数名类型说明入参角色实体实体需要复苏的指定角色实体复苏玩家所有角色节点类型：执行节点功能复苏玩家的所有角色在超限模式中，与【复苏角色】功能相似，会复苏玩家的角色并解除所有角色倒下状态，可以选择是否扣除玩家的复苏次数节点参数参数类型参数名类型说明入参玩家实体实体需要所有角色复苏的玩家实体入参是否扣除复苏次数布尔值如果为【是】，则复苏时扣除1次复苏次数。如果复苏次数不足1次，则该节点无法执行击倒玩家所有角色节点类型：执行节点功能击倒玩家的所有角色，会使玩家进入所有角色倒下状态节点参数参数类型参数名类型说明入参玩家实体实体目标玩家实体设置玩家复苏耗时节点类型：执行节点功能修改指定玩家的下次复苏耗时如果玩家当前处于复苏计时中，不会修改当前的复苏耗时节点参数参数类型参数名类型说明入参玩家实体实体目标玩家实体入参时长浮点数设置的复苏时间，以秒为单位设置玩家剩余复苏次数节点类型：执行节点功能修改指定玩家剩余的复苏次数设置为0会使这名玩家无法复苏节点参数参数类型参数名类型说明入参玩家实体实体目标玩家实体入参剩余次数整数设置的剩余复苏次数允许/禁止玩家复苏节点类型：执行节点功能修改指定玩家是否允许复苏节点参数参数类型参数名类型说明入参玩家实体实体目标玩家实体入参是否允许布尔值设置是否允许复苏玩家所有角色复苏时节点类型：事件节点功能当玩家所有角色解除倒下状态、复苏时触发。注意，因为角色复苏导致的玩家解除倒下状态不会触发这个事件由于玩家解除倒下状态并复苏也会导致角色解除倒下状态并复苏，因此也会在这个事件后触发【角色复苏时】事件节点参数参数类型参数名类型说明出参玩家实体实体被复苏的玩家实体玩家所有角色倒下时节点类型：事件节点功能玩家进入所有角色倒下状态时触发节点参数参数类型参数名类型说明出参玩家实体实体所有角色倒下的玩家实体出参原因枚举玩家所有角色倒下的原因包含以下几个原因-节点图导致：被节点图中的节点击倒-正常击倒：因玩家队伍内所有角色生命值降为0所有角色倒下-非正常击倒：因为坠落深渊、溺水等原因被击倒玩家异常倒下并复苏时节点类型：事件节点功能玩家因坠落深渊、溺水等原因被击倒并复苏时节点参数参数类型参数名类型说明出参玩家实体实体因溺水、坠落深渊等原因被击倒的玩家实体角色倒下时节点类型：事件节点功能角色倒下时触发的事件在当前模式中，因为玩家只有一名角色，因此之后会连续触发【玩家所有角色倒下时】节点参数参数类型参数名类型说明出参角色实体实体因溺水、坠落深渊等原因被击倒的角色实体出参原因枚举角色倒下的原因包含以下几个原因-节点图导致：被节点图中的节点击倒-正常击倒：因玩家队伍内所有角色生命值降为0所有角色倒下-非正常击倒：因为坠落深渊、溺水等原因被击倒出参击倒者实体实体击倒该角色的实体角色复苏时节点类型：事件节点功能角色复苏时触发的事件节点参数参数类型参数名类型说明出参角色实体实体复苏的角色实体查询玩家角色是否全部倒下节点类型：查询节点功能查询玩家的所有角色是否已全部倒下节点参数参数类型参数名类型说明入参玩家实体实体查询的目标玩家实体出参结果布尔值是否已全部倒下获取玩家复苏耗时节点类型：查询节点功能获取指定玩家的复苏耗时节点参数参数类型参数名类型说明入参玩家实体实体查询的目标玩家实体出参时长浮点数获取的复苏耗时获取玩家剩余复苏次数节点类型：查询节点功能查询玩家的剩余复苏次数节点参数参数类型参数名类型说明入参玩家实体实体查询的目标玩家实体出参剩余次数整数获取的剩余复苏次数"
}