{
  "mhn7ko01v3yw": "一、自定义变量1.节点图变量变化时节点功能当前节点图的节点图变量发生变化时，触发该事件注意变化前值和变化后值为泛型，需确定其泛型类型后，才能正确接收到对应类型节点图变量的事件容器类型的节点图变量没有变化前值和变化后值出参节点参数参数类型参数名类型说明出参事件源实体实体与节点图关联的实体出参事件源GUIDGUID与节点图关联的实体的GUID出参变量名字符串发生变化的变量的名称出参变化前值泛型变量变化前的值出参变化后值泛型变量变化后的值2.自定义变量变化时节点功能当前节点图所关联实体的自定义变量发生变化时，触发该事件注意变化前值和变化后值为泛型，需确定其泛型类型后，才能正确接收到对应类型自定义变量的事件容器类型的自定义变量没有变化前值和变化后值出参节点参数参数类型参数名类型说明出参事件源实体实体与节点图关联的实体出参事件源GUIDGUID与节点图关联的实体的GUID出参变量名字符串发生变化的变量的名称出参变化前值泛型变量变化前的值出参变化后值泛型变量变化后的值二、预设状态1.预设状态变化时节点功能节点图所关联的实体的预设状态发生变化时，触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参预设状态索引整数出参变化前值整数出参变化后值整数三、实体相关1.角色移动速度达到条件时节点功能为角色实体添加单位状态效果【监听移动速率】，达成条件会触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参单位状态配置ID配置ID出参条件：比较类型枚举出参条件：比较值浮点数出参当前移动速度浮点数2.实体创建时节点功能实体被创建时，触发该事件所有类型的实体均可以触发该事件。关卡实体、角色实体和玩家实体会在进入关卡时触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID3.实体销毁时节点功能关卡内任意实体被销毁时触发该事件，该事件仅在关卡实体上可以触发。任意类型的实体销毁均可以触发该事件，包括角色实体被击倒仅包含因战斗（生命值变为0）或【销毁实体】节点而造成的销毁会触发该事件节点参数参数类型参数名类型说明出参事件源实体实体被销毁的实体出参事件源GUIDGUID出参位置三维向量出参朝向三维向量出参实体类型枚举出参阵营阵营出参伤害来源实体出参归属者实体实体出参自定义变量组件快照自定义变量快照销毁时，该实体上的自定义变量组件的快照。可以使用【查询自定义变量快照】节点获取其中的自定义变量值4.实体移除/销毁时节点功能关卡内任意实体被移除或销毁时触发该事件，该事件仅在关卡实体上可以触发实体被销毁或被移除均会触发该事件。因此实体被销毁时，会依次触发【实体销毁时】以及【实体移除/销毁时】事件节点参数参数类型参数名类型说明出参事件源GUIDGUID四、阵营相关1.实体阵营变化时节点功能实体的阵营变化时，触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参变化前阵营阵营出参变化后阵营阵营五、玩家与角色相关1.角色倒下时节点功能角色倒下时，角色实体上的节点图可以触发该事件节点参数参数类型参数名类型说明出参角色实体实体出参原因枚举节点图导致：因节点图的【销毁实体】节点导致的角色倒下正常倒下：因生命值变为0导致的角色倒下非正常倒下：因溺水、坠入深渊等导致的角色倒下出参击倒者实体实体2.角色复苏时节点功能角色复苏时，角色实体上的的节点图可以触发该事件节点参数参数类型参数名类型说明出参角色实体实体3.玩家传送完成时节点功能玩家传送完成时，在玩家实体的节点图上可以触发该事件玩家首次进入关卡时，也会触发该事件节点参数参数类型参数名类型说明出参玩家实体实体出参玩家GUIDGUID4.玩家所有角色倒下时节点功能玩家的所有角色实体均倒下时，玩家实体的节点图上触发该事件节点参数参数类型参数名类型说明出参玩家实体实体出参原因枚举节点图导致：因节点图的【销毁实体】节点导致的角色倒下正常倒下：因生命值变为0导致的角色倒下非正常倒下：因溺水、坠入深渊等导致的角色倒下5.玩家所有角色复苏时节点功能玩家的所有角色均复苏时，玩家实体的节点图触发该事件节点参数参数类型参数名类型说明出参玩家实体实体6.玩家异常倒下并复苏时节点功能角色因溺水、坠入深渊等原因倒下并复苏时，玩家实体上触发该事件节点参数参数类型参数名类型说明出参玩家实体实体六、碰撞触发器1.进入碰撞触发器时节点功能运行中实体A的”碰撞触发源“范围，进入其他运行中实体B的“碰撞触发器”范围。会发送节点图事件给配置“碰撞触发器”的实体B节点参数参数类型参数名类型说明出参进入者实体实体上述中的实体A出参进入者实体GUIDGUID出参触发器实体实体上述中的实体B出参触发器实体GUIDGUID出参触发器序号整数实体B碰撞触发器组件中的对应序号的触发器2.离开碰撞触发器时节点功能运行中实体A的“碰撞触发源”范围，离开其他运行中实体B的“碰撞触发器”范围会发送节点图事件给配置“碰撞触发器”的实体B节点参数参数类型参数名类型说明出参离开者实体实体上述中的实体A出参离开者实体GUIDGUID出参触发器实体实体上述中的实体B出参触发器实体GUIDGUID出参触发器序号整数七、战斗1.被恢复生命值时节点功能实体被恢复生命值时，触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参治疗者实体实体出参恢复量浮点数实际的恢复量。如果实体恢复前并未损失生命值，则恢复量为0出参恢复标签列表字符串列表2.发起恢复生命值时节点功能实体向其他实体恢复生命值时，发起者实体上触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参恢复目标实体实体出参恢复量浮点数实际的恢复量。如果目标实体恢复前并未损失生命值，则恢复量为0出参恢复标签列表字符串列表3.攻击命中时节点功能实体的攻击命中其他实体时，触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参受击者实体实体出参伤害量浮点数实际造成的伤害量。因无敌等原因未造成伤害时，伤害量为0出参攻击标签列表字符串列表出参元素类型枚举出参元素攻击强效浮点数攻击包含的元素含量4.受到攻击时节点功能实体受到攻击时触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参攻击者实体实体出参伤害量浮点数实际造成的伤害量。因无敌等原因未造成伤害时，伤害量为0出参攻击标签列表字符串列表出参元素类型枚举出参元素攻击强效浮点数攻击包含的元素含量5.进入易受打断状态时节点功能实体被攻击进入易受打断状态时触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参攻击者实体八、运动器1.基础运动器停止时节点功能基础运动器组件上的某个基础运动器完成运动时或被关闭时向组件持有者发送该事件节点参数参数类型参数名类型说明出参事件源实体实体组件持有者出参事件源GUIDGUID出参运动器名称字符串2.路径到达路点时节点功能路径运动器到达路点时发送给基础运动器组件的持有者，需要在路点配置中配置“到达路点发送事件”才会触发该事件节点参数参数类型参数名类型说明出参事件源实体实体组件持有者出参事件源GUIDGUID出参运动器名称字符串出参路径点序号整数九、命中判定1.命中检测触发时节点功能命中检测组件命中其他实体或场景时组件的持有者触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参是否命中受击盒布尔值为否时，命中的是场景为是时，命中实体，此时可以从【命中实体】出参中取出值出参命中实体实体仅当命中受击盒时，命中实体才有意义出参命中位置三维向量十、定时器1.定时器触发时节点功能定时器运行到指定时间节点时，触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参定时器名称字符串出参定时器序列序号整数出参循环次数整数十一、全局计时器1.全局计时器触发时节点功能当倒计时的全局计时器计时结束时，会触发该事件正计时的全局计时器不会触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参计时器名称字符串十二、界面控件组1.界面控件组触发时节点功能只有交互按钮和道具展示类型的界面控件，才会触发本事件在关卡运行中，通过交互按钮或道具展示界面控件制作的界面控件组，被执行交互操作会发送节点图事件”界面控件组触发时“，此事件只有触发交互的玩家节点图可以获取节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参界面控件组组合索引整数如果触发该事件的界面控件和其他界面控件组成了多控件界面控件组(即界面控件组组合)，此出参会有对应的值出参界面控件组索引整数触发该事件的界面控件为单控件界面控件组，则此处为该界面控件组的索引。触发该事件的界面控件为多控件界面控件组，则此处为组合内对应该界面控件的索引十三、单位状态1.单位状态变更时节点功能单位状态的层数发生变化时，触发该事件单位状态的施加以及移除都会触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参单位状态配置ID配置ID出参施加者实体实体出参持续时间是否无限布尔值出参状态剩余时长浮点数出参状态剩余层数整数变化后的层数出参状态原始层数整数变化前的层数出参槽位序号整数发生变化的单位状态槽位的序号2.单位状态结束时节点功能单位状态因为各种原因被移除或因时长结束时触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参单位状态配置ID配置ID出参施加者实体实体出参持续时间是否无限布尔值出参状态剩余时长浮点数出参状态剩余层数整数出参移除者实体实体出参移除原因枚举其他单位状态顶替：因被施加了顶替状态导致单位状态被移除超出持续时间：超出单位状态持续事件被驱散：单位状态被直接移除状态失效：因其他原因导致的状态失效职业变更：因职业变更导致的状态被移除出参槽位序号整数发生变化的单位状态槽位的序号3.发生元素反应事件时节点功能为实体添加单位状态效果【监听元素反应】，达成条件会触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参元素反应类型枚举出参触发者实体实体出参触发者GUIDGUID4.护盾受到攻击时节点功能为实体添加单位状态效果【添加护盾】，受到攻击时触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参攻击者实体实体出参攻击者GUIDGUID出参单位状态配置ID配置ID出参攻击前层数整数出参攻击后层数整数出参攻击前该单位状态的护盾含量浮点数出参攻击后该单位状态的护盾含量浮点数十四、选项卡1.选项卡选中时节点功能生效的选项卡被选中后，会向节点图发送事件配置选项卡组件的实体节点图，会接收该事件节点参数参数类型参数名类型说明出参事件源实体实体挂载选项卡组件的实体出参事件源GUIDGUID挂载选项卡组件的实体GUID，若无则输出0出参选项卡序号整数选项卡的序号出参选择者实体实体触发选项卡时的角色实体十五、造物1.造物入战时节点功能仅在经典仇恨模式生效造物入战时触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID2.造物脱战时节点功能仅在经典仇恨模式生效造物脱战时触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID十六、职业1.玩家职业等级变化时节点功能玩家职业等级变化时触发该事件发送给对应玩家，可以在该职业的职业节点图里收到节点参数参数类型参数名类型说明出参事件源实体实体生效的玩家实体出参事件源GUIDGUID出参变化前等级整数出参变化后等级整数2.玩家职业更改时节点功能玩家职业更改时触发该事件发送给对应玩家，可以在更改后职业的职业节点图里收到节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参更改前职业配置ID配置ID出参更改后职业配置ID配置ID3.玩家职业解除时节点功能玩家职业解除时触发该事件发送给对应玩家，可以在更改前职业的职业节点图里收到节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参更改前职业配置ID配置ID出参更改后职业配置ID配置ID十七、技能1.技能节点调用时节点功能通过技能节点图的【通知服务器节点图】节点触发，可以传入三个字符串类型的值节点参数参数类型参数名类型说明出参调用者实体实体出参调用者GUIDGUID出参参数1字符串出参参数2字符串出参参数3字符串十八、自定义仇恨1.仇恨目标变化时节点功能仅自定义仇恨模式可用仇恨目标发生变化时，触发该事件入战和脱战也可以触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参变化前仇恨目标实体出参变化后仇恨目标实体2.自身入战时节点功能仅自定义仇恨模式可用实体自身入战时，触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID3.自身脱战时节点功能仅自定义仇恨模式可用实体自身脱战时，触发该事件节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID十九、信号1.监听信号节点功能监听已在信号管理器中定义的信号触发事件需先选择需要监听的信号名节点参数参数类型参数名类型说明出参事件源实体实体出参事件源GUIDGUID出参信号来源实体实体使用【发送信号】节点发送该信号的实体二十、卡牌选择器1.卡牌选择器完成时节点功能玩家操作完成卡牌选择器/或者因为时间原因强制关闭等，都会给玩家节点图触发本事件出参可以通知本次卡牌选择器的结果，和对应原因节点参数参数类型参数名类型说明出参目标玩家实体生效的玩家实体出参选择结果列表整数列表触发选择选择交互时，合法的选择结果会作为该出参提供，并且完成原因为玩家完成唤起弹窗选择全量刷新，触发刷新交互时，全量的选择结果对应列表会作为该出参提供，并且完成原因为全量刷新唤起弹窗选择部分刷新，触发刷新交互时，合法的选择结果会作为该出参提供，并且完成原因为定量刷新卡牌选择器超时未交互时，默认返回选择会作为该出参提供，并且完成原因为超时关闭卡牌选择器的可放弃选择勾选时，触发关闭交互时，默认返回选择会作为该出参提供，并且完成原因为主动关闭通过节点图关闭卡牌选择器节点造成的卡牌选择器关闭，默认返回选择会作为该出参提供，并且完成原因为节点图关闭出参完成原因枚举六种原因枚举玩家完成、全量刷新、定量刷新、超时关闭、主动关闭、节点图关闭出参卡牌选择器索引整数引用的卡牌选择器索引二十一、文本气泡1.文本气泡完成时节点功能该事件仅能被挂载文本气泡组件，且完成对话的实体节点图接收完成的含义是最后一句对话播放完成节点参数参数类型参数名类型说明出参气泡归属者实体实体挂载文本气泡组件的运行时实体出参角色实体实体当前气泡对话的目标角色出参文本气泡配置ID配置ID当前生效的文本气泡配置ID出参文本气泡完成次数整数当前生效的文本气泡，对该对话角色，完整播放了几次二十二、商店1.商店出售背包物品时节点功能商店出售背包物品时触发，商店组件的持有者可收到节点参数参数类型参数名类型说明出参商店持有者实体出参商店持有者GUIDGUID出参购买者实体实体出参商店序号整数出参道具配置ID配置ID出参购买数量整数2.商店出售自定义商品时节点功能商店出售自定义物品时触发，商店组件的持有者可收到节点参数参数类型参数名类型说明出参商店持有者实体出参商店持有者GUIDGUID出参购买者实体实体出参商店序号整数出参商品序号整数出参购买数量整数3.商店收购道具时节点功能商店收购道具时触发，商店组件的持有者可收到节点参数参数类型参数名类型说明出参商店持有者实体出参商店持有者GUIDGUID出参出售者实体实体出参商店序号整数出参收购物品字典字典二十三、装备1.装备被穿戴时节点功能装备被穿戴时触发该事件，装备的持有者可以收到，需要配置在道具节点图里节点参数参数类型参数名类型说明出参装备持有者实体实体出参装备持有者GUIDGUID出参装备索引整数2.装备被卸下时节点功能装备被卸下时触发该事件，装备的持有者可以收到，需要配置在道具节点图里节点参数参数类型参数名类型说明出参装备持有者实体实体出参装备持有者GUIDGUID出参装备索引整数3.装备初始化时节点功能当装备首次被获取进入背包时，会进行初始化，此时事件出参会返回装备实例的唯一索引，通过此索引即可对装备进行动态修改。装备的持有者可以收到该事件，需要配置在道具节点图里节点参数参数类型参数名类型说明出参装备持有者实体出参装备持有者GUIDGUID出参装备索引整数4.装备的词条数值改变时节点功能装备词条数值改变时触发该事件，装备的持有者可以收到，需要配置在道具节点图里节点参数参数类型参数名类型说明出参装备持有者实体出参装备持有者GUIDGUID出参装备索引整数出参词条序号整数该词条在装备词条上的对应序号出参改变前数值浮点数出参改变后数值浮点数二十四、道具1.背包道具失去时节点功能背包内该道具失去，即背包内该道具数量为0时触发该事件，背包组件的持有者可以收到节点参数参数类型参数名类型说明出参道具持有者实体实体出参道具持有者GUIDGUID出参道具配置ID配置ID出参失去数量整数2.背包道具数量变化时节点功能背包道具数量发生变化时触发该事件，背包组件的持有者可以收到节点参数参数类型参数名类型说明出参道具持有者实体实体出参道具持有者GUIDGUID出参道具配置ID配置ID出参变化前数量整数出参变化后数量整数出参变化原因枚举3.背包道具新增时节点功能背包内新增该道具时触发事件，背包组件的持有者可以收到。如果没有新增道具仅有数量变化则不会触发该事件节点参数参数类型参数名类型说明出参道具持有者实体实体出参道具持有者GUIDGUID出参道具配置ID配置ID出参获得数量整数4.背包货币数量变化时节点功能背包货币数量变化时触发该事件，背包组件的持有者可以收到节点参数参数类型参数名类型说明出参货币持有者实体实体出参货币持有者GUIDGUID出参货币配置ID配置ID出参货币变化值整数5.背包内道具被使用时节点功能背包内道具被使用时触发该事件，背包组件的持有者可以收到节点参数参数类型参数名类型说明出参道具持有者实体实体出参道具持有者GUIDGUID出参道具配置ID配置ID出参使用数量整数二十五、造物巡逻1.造物抵达巡逻路点时节点功能若在巡逻模板编辑中，勾选了指定路点的到达发送节点图事件选项，则会在满足条件时，收到该节点图事件该节点图事件只能造物的节点图收到节点参数参数类型参数名类型说明出参造物实体实体运行时的造物实体出参造物GUIDGUID造物的GUID，若非初始布设的造物，则输出为空出参当前巡逻模板序号整数造物当前生效的巡逻模板序号出参当前路径索引整数造物当前生效的巡逻模板引用的路径索引出参当前抵达路点序号整数造物当前抵达的路点序号出参即将前往路点序号整数造物即将前往的路点序号"
}