{
  "mhnd4l069tk0": "一、通用1.枚举是否相等节点功能确认枚举的类型后，判断两个输入的值是否相等节点参数参数类型参数名类型说明入参枚举1泛型入参枚举2泛型出参结果布尔值相等输出“是”，不相等输出“否”2.拼装列表节点功能将多个类型相同的入参(至多100个)拼装为一个列表节点参数参数类型参数名类型说明入参0~99泛型将至多100个参数拼装为一个列表出参列表泛型列表拼装成的列表3.是否相等节点功能判断两个输入是否相等部分参数类型有较为特殊的判定规则：浮点数：浮点数采用近似相等进行比较，当两个浮点数小于一个极小值时，这两个浮点数认为相等。例如：2.0000001与2.0认为相等三维向量：三维向量的x、y、z分别采用浮点数近似相等比较节点参数参数类型参数名类型说明入参枚举1泛型入参枚举2泛型出参结果布尔值相等输出“是”，不相等输出“否”4.数据类型转换节点功能将输入的参数类型转换为另一种类型输出。具体规则见-【基础数据类型之间的转换规则】节点参数参数类型参数名类型说明入参输入泛型出参输出泛型二、数学1.拆分三维向量节点功能将三维向量的x、y、z分量输出为三个浮点数节点参数参数类型参数名类型说明入参三维向量三维向量出参X分量浮点数出参Y分量浮点数出参Z分量浮点数2.乘法运算节点功能乘法运算，支持浮点数乘法和整数乘法节点参数参数类型参数名类型说明入参泛型入参泛型出参结果泛型3.除法运算节点功能除法运算，支持浮点数除法和整数除法。整数除法返回整除结果除数不应为0，否则可能返回非法值节点参数参数类型参数名类型说明入参泛型入参泛型出参结果泛型4.创建三维向量节点功能根据x、y、z分量创建一个三维向量节点参数参数类型参数名类型说明入参X分量浮点数入参Y分量浮点数入参Z分量浮点数出参三维向量三维向量5.对数运算节点功能计算以底数为底真数的对数底数不应为负数或等于1、真数不应为负数，否则可能产生非法值节点参数参数类型参数名类型说明入参真数浮点数入参底数浮点数出参结果浮点数6.反余弦函数节点功能计算输入的反余弦值，返回为弧度值节点参数参数类型参数名类型说明入参输入浮点数出参弧度浮点数7.反正切函数节点功能计算输入的反正切值，返回为弧度值节点参数参数类型参数名类型说明入参输入浮点数出参弧度浮点数8.反正弦函数节点功能计算输入的反正弦值，返回为弧度值节点参数参数类型参数名类型说明入参输入浮点数出参弧度浮点数9.范围限制运算节点功能将输入值限制在[下限,上限]（上下限均包含）后输出。如果输入值在下限到上限范围内，则返回原值输入值如果小于下限，则返回下限值；如果输入值大于上限，则返回上限值如果下限大于上限，认为是错误输入，返回非法值节点参数参数类型参数名类型说明入参输入泛型入参下限泛型入参上限泛型出参结果泛型10.方向向量转旋转节点功能给定向前向量和向上向量，转化为欧拉角节点参数参数类型参数名类型说明入参向前向量三维向量表示单位期望的朝向入参向上向量三维向量定义单位的上方向（用于确定旋转的旋转角度），默认值为世界坐标系Y轴正方向出参旋转三维向量11.根据格式化时间计算时间戳节点功能根据输入的格式化时间将其转化为时间戳节点参数参数类型参数名类型说明入参年整数入参月整数入参日整数入参时整数入参分整数入参秒整数出参时间戳整数12.根据时间戳计算格式化时间节点功能根据输入的时间戳将其转化为格式化时间节点参数参数类型参数名类型说明入参时间戳整数出参年整数出参月整数出参日整数出参时整数出参分整数出参秒整数13.根据时间戳计算星期几节点功能根据输入的时间戳将其转化为星期几节点参数参数类型参数名类型说明入参时间戳整数出参星期整数14.弧度转角度节点功能将弧度值转为角度值节点参数参数类型参数名类型说明入参弧度值浮点数出参角度值浮点数15.加法运算节点功能计算两个浮点数或整数的加法节点参数参数类型参数名类型说明入参泛型入参泛型出参结果泛型16.减法运算节点功能计算两个浮点数或整数的减法节点参数参数类型参数名类型说明入参泛型入参泛型出参结果泛型17.角度转弧度节点功能将角度值转为弧度值节点参数参数类型参数名类型说明入参角度值浮点数出参弧度值浮点数18.取较大值节点功能取出两个输入中较大的一个节点参数参数类型参数名类型说明入参输入1泛型入参输入2泛型出参较大值泛型19.取较小值节点功能取出两个输入中较小的一个节点参数参数类型参数名类型说明入参输入1泛型入参输入2泛型出参较小值泛型20.绝对值运算节点功能返回输入的绝对值节点参数参数类型参数名类型说明入参输入泛型出参结果泛型21.两坐标点距离节点功能计算两个坐标点之间的欧式距离节点参数参数类型参数名类型说明入参坐标点1三维向量入参坐标点2三维向量出参距离浮点数22.逻辑非运算节点功能对输入的布尔值进行非运算后输出节点参数参数类型参数名类型说明入参输入布尔值出参结果布尔值23.逻辑或运算节点功能对输入的两个布尔值进行或运算后输出节点参数参数类型参数名类型说明入参输入1布尔值入参输入2布尔值出参结果布尔值24.逻辑异或运算节点功能对输入的两个布尔值进行异或运算后输出节点参数参数类型参数名类型说明入参输入1布尔值入参输入2布尔值出参结果布尔值25.逻辑与运算节点功能对输入的两个布尔值进行与运算后输出节点参数参数类型参数名类型说明入参输入1布尔值入参输入2布尔值出参结果布尔值26.幂运算节点功能计算底数的指数次幂节点参数参数类型参数名类型说明入参底数泛型入参指数泛型出参结果泛型27.模运算节点功能返回输入2对输入1的取模运算节点参数参数类型参数名类型说明入参整数入参整数出参结果整数28.算术平方根运算节点功能返回输入值的算术平方根节点参数参数类型参数名类型说明入参输入浮点数出参结果浮点数29.取符号运算节点功能输入为正数时，返回1输入为负数时，返回-1输入为0时，返回0节点参数参数类型参数名类型说明入参输入泛型出参结果泛型30.取整数运算节点功能根据取整方式进行一次取整运算，返回取整后的正数节点参数参数类型参数名类型说明入参输入浮点数入参取整方式枚举四舍五入：按照四舍五入规则进行取整向上取整：返回大于输入且离输入值最近的一个整数，例如：输入为1.2时，返回2；输入为-2.3时，返回-2向下取整：返回小于输入且离输入值最近的一个整数。例如：输入为1.2时，返回1；输入为-2.3时，返回-3截尾取整：截去浮点数尾部的小数部分，也相当于向0方向取整。例如：输入为1.2时，返回1；输入为-2.3时，返回-2出参结果整数31.三维向量归一化节点功能将三维向量的长度归一化后输出节点参数参数类型参数名类型说明入参三维向量三维向量出参结果三维向量32.三维向量加法节点功能计算两个三维向量的加法节点参数参数类型参数名类型说明入参三维向量1三维向量入参三维向量2三维向量出参结果三维向量33.三维向量夹角节点功能计算两个三维向量之间的夹角，以弧度输出节点参数参数类型参数名类型说明入参三维向量1三维向量入参三维向量2三维向量出参夹角(弧度)浮点数34.三维向量减法节点功能计算两个三维向量的减法节点参数参数类型参数名类型说明入参三维向量1三维向量入参三维向量2三维向量出参结果三维向量35.三维向量模运算节点功能计算输入的三维向量的模节点参数参数类型参数名类型说明入参三维向量三维向量出参结果浮点数36.三维向量内积节点功能计算两个输入三维向量的内积（点乘）节点参数参数类型参数名类型说明入参三维向量1三维向量入参三维向量2三维向量出参结果浮点数37.三维向量缩放节点功能将输入的三维向量缩放后输出（三维向量数乘）节点参数参数类型参数名类型说明入参三维向量三维向量入参缩放倍率浮点数出参结果三维向量38.三维向量外积节点功能计算两个三维向量的外积（叉乘）节点参数参数类型参数名类型说明入参三维向量1三维向量入参三维向量2三维向量出参结果三维向量39.三维向量旋转节点功能将被旋转的三维向量，按照旋转所表示的欧拉角进行旋转后返回结果节点参数参数类型参数名类型说明入参旋转三维向量该输入的三维向量指代一个特定的旋转欧拉角入参被旋转的三维向量三维向量出参结果三维向量40.数值大于节点功能返回左值是否大于右值节点参数参数类型参数名类型说明入参左值泛型入参右值泛型出参结果布尔值41.数值大于等于节点功能返回左值是否大于等于右值节点参数参数类型参数名类型说明入参左值泛型入参右值泛型出参结果布尔值42.数值小于节点功能返回左值是否小于右值节点参数参数类型参数名类型说明入参左值泛型入参右值泛型出参结果布尔值43.数值小于等于节点功能返回左值是否小于等于右值节点参数参数类型参数名类型说明入参左值泛型入参右值泛型出参结果布尔值44.余弦函数节点功能计算输入弧度的余弦节点参数参数类型参数名类型说明入参弧度浮点数出参结果浮点数45.正切函数节点功能计算输入弧度的正切节点参数参数类型参数名类型说明入参弧度浮点数出参结果浮点数46.正弦函数节点功能计算输入弧度的正弦节点参数参数类型参数名类型说明入参弧度浮点数出参结果浮点数47.左移运算节点功能将输入值作为二进制数逻辑左移一定位数后输出节点参数参数类型参数名类型说明入参值整数入参左移位数整数出参结果整数48.右移运算节点功能将输入值作为二进制数逻辑右移一定位数后输出节点参数参数类型参数名类型说明入参值整数入参右移位数整数出参结果整数49.按位与节点功能将输入的两个值作为二进制进行按位与运算后返回结果节点参数参数类型参数名类型说明入参值1整数入参值2整数出参结果整数50.按位或节点功能将输入的两个值作为二进制进行按位或运算后返回结果节点参数参数类型参数名类型说明入参值1整数入参值2整数出参结果整数51.按位异或节点功能将输入的两个值作为二进制进行按位异或运算后返回结果节点参数参数类型参数名类型说明入参值1整数入参值2整数出参结果整数52.按位取补运算节点功能将输入值作为二进制进行按位取补运算后返回结果节点参数参数类型参数名类型说明入参值整数出参结果整数53.按位写入节点功能将写入值作为二进制数，写入被写入值（同样作为二进制数）的【起始位，结束位】。起始位从0开始算，写入的值长度包含起始位和结束位如果写入值的二进制有效数字长度（从左起第一个1开始计算）超过写入的长度，则写入失败，返回被写入值如果写入值是负数，也会因为写入值超出长度而写入失败（负数的二进制首位为符号位1）节点参数参数类型参数名类型说明入参被写入值整数入参写入值整数入参写入起始位整数入参写入结束位整数出参结果整数54.按位读出节点功能从值（以二进制表示）的【起始位，结束位】读出值节点参数参数类型参数名类型说明入参值整数入参读出起始位整数入参读出结束位整数出参结果整数三、字典1.建立字典节点功能根据输入的键和值列表的顺序依次建立键值对。此节点会按照键和值列表中较短的一个进行字典创建，多余的部分会被截断如果键列表中存在重复值，则会创建失败，返回空字典节点参数参数类型参数名类型说明入参键列表泛型入参值列表泛型出参字典泛型2.拼装字典节点功能将至多50个键值对拼合为一个字典节点参数参数类型参数名类型说明入参键0~49泛型入参值0~49泛型出参字典泛型字典四、结构体1.拆分结构体节点功能获取指定结构体的所有参数节点参数参数类型参数名类型说明2.拼装结构体节点功能将多个参数拼合为一个结构体类型的值节点参数参数类型参数名类型说明"
}