{
  "mhou93r2pxv2": "最终值 =（基础值+变更量）*（1+调整率）* 倍率 + 修正值“变更量“表示基础数值的变化程度“调整率“表示数值额外缩放的系数“倍率”表示数值整体缩放的系数“修正值”表示数值最终增减的变化程度单位状态示意效果受打断倍率影响受到攻击时，受打断值增长的倍率。当这个值为0时，说明受到伤害不增加受打断值，即实体霸体坠落效率变更量影响坠落时坠落加速度。在默认状态下，所有角色和造物有200%的坠落效率，因此当该值设为-200%时，可以使角色或造物无视重力坠落伤害调整率影响角色坠落时受到的坠落伤害。为-100时，使角色完全不受到坠落伤害最大生命值调整率影响实体的最大生命值最大生命值修正值影响实体的最大生命值移动速度调整率影响角色、造物的移动速度攻击速度调整率影响角色的攻击速度体力消耗调整率影响角色在奔跑、游泳等状态下的体力消耗。设为-100%时可以使这些行为不消耗体力体力恢复调整率影响角色在损失体力后的体力恢复效率。设为-100%时可以使角色无法恢复体力防御力调整率影响实体的防御力防御力修正值影响实体的防御力攻击力调整率影响实体的攻击力攻击力修正值影响实体的攻击力暴击触发变更量影响实体的暴击率抗暴击触发变更量影响受到攻击时，攻击者的暴击率暴击伤害变更量影响实体的暴击伤害攻击增伤调整率影响实体的攻击增伤率受击减伤调整率影响实体的受击减伤率恢复效果调整率影响实体施加的恢复效果受恢复效果调整率影响实体受到的恢复效果元素增伤调整率影响实体造成的元素伤害，包括物理以及七种元素元素抗性调整率影响实体受到的元素伤害，包括物理以及七种元素元素精通修正值影响实体的元素精通值剧变反应增伤调整率影响实体造成的剧变反应的伤害包括以下元素反应：扩散、超导、感电、点燃、冻结、超载、碎冰、绽放、烈绽放、超绽放增幅反应增伤调整率影响实体造成的增幅反应的伤害包括以下元素反应：蒸发、融化激化反应增伤调整率影响实体造成的激化反应的伤害包括以下元素反应：超激化、蔓激化无视防御调整率影响实体造成伤害时无视的防御比例无视防御修正值影响实体造成伤害时无视的防御数值元素伤害免疫设为【是】时，可以免疫特定元素的伤害，包括物理以及七种元素技能冷却效率变更量影响角色技能的冷却时间缩减效率，这个数值越高，角色的技能冷却越快挂载特效在实体上挂载一个循环特效，配置与特效相关配置基本一致元素附着在实体上附着一个特定类型的元素。这个元素不会自然消耗，但会被元素反应消耗特殊状态：无敌使实体进入无敌状态无敌状态下，无法受到任何伤害，且受到攻击不会触发【受到攻击时】事件特殊状态：禁止锁定使实体进入禁止锁定状态该状态下，造物自动锁定类的攻击和技能无法锁定该实体特殊状态：锁定生命值使实体进入锁定生命值状态该状态下，生命无法降低，但受到攻击时会触发【受到攻击时】事件特殊状态：挣扎使实体进入挣扎状态该状态下，实体无法做出任何行动。玩家可以通过快速点按挣脱键进行挣脱特殊状态：禁止恢复生命值使实体进入禁止恢复生命值状态该状态下，实体无法恢复生命特殊状态：禁止生命低于指定值使实体进入禁止生命低于指定值状态该状态下，实体的生命禁止低于生命阈值所配置的生命百分比其他玩家不可见在该状态下，其他玩家无法看见处于此状态下的角色超级跳该状态下，角色获得增强跳跃的能力xz倍率为平面上跳跃的距离，超过1即增强平面的跳跃距离y倍率为向上跳跃的高度，超过1即增强向上跳跃的高度阻止攻击元素附着该状态下，造物造成的元素攻击无法附着元素被击退效率受到攻击时，击退力的大小会受该值影响，从而影响击退距离或高度。免疫嘲讽免疫经典仇恨模式和自定义仇恨模式的嘲讽仇恨倍率调整率获得仇恨值时的调整率仇恨倍率修正值获得仇恨值时的修正值禁用滑翔禁止角色滑翔禁用攀爬禁止角色攀爬铭牌隐藏隐藏该单位的铭牌禁用挣扎按钮角色进入挣扎状态时，无法通过挣扎按钮提前挣脱隐藏实体的小地图标识隐藏实体在小地图上的显示禁用冲刺禁止角色冲刺禁用跳跃禁止角色跳跃造物沉默使造物无法释放技能禁止移动限制造物的常规移动，不会影响技能过程中的移动，也不会影响技能造成的移动效果护盾获得护盾，参数引用护盾配置护盾强效调整率获得护盾时，按照调整率改变获得的护盾值修正小地图方向可选择以角色朝向为小地图正上方，还是以指定的偏转角度为小地图的正上方挂载透视效果当布尔型本地过滤器返回TRUE，并且挂载实体被遮挡时，该实体会以配置颜色穿透显示挂载描边效果实体边缘会显示配置颜色描边物件不可见当布尔型本地过滤器返回TRUE，实体不可见监听移动速率添加后，将在条件满足的时候触发角色挂载的节点图事件【角色移动速度达到条件时】。同时，添加该单位状态的角色，可以通过【查询角色当前移动速度】节点获取移动速度、方向。冲刺时不关闭受击盒冲刺时，不关闭受击盒。（默认情况下，角色冲刺会短暂关闭受击盒）角色隐藏布尔型本地过滤器返回true时，隐藏角色并根据参数设置屏蔽音频、特效覆写扫描标签数据添加后，角色的扫描标签组件数据将按照设置参数生效监听元素反应设置事件的发送目标和监听的反应类型，当该实体发生指定元素反应时，可触发目标实体挂载的节点图事件【发生元素反应时】角色隐藏半透明、全透明，都是隐藏的一种状态布尔型本地过滤器的判定结果可以理解为【本地对挂载角色隐藏的角色是否可见】当屏蔽特效、音频全勾选上时：从本地看挂载该状态的角色，若过滤器判定true，挂载角色虚化半透明，屏蔽特效不会生效，屏蔽音效不会生效过滤器判定false，挂载角色完全隐藏屏蔽特效生效，通过特效组件、特效单位状态挂上的特效不会生效屏蔽音效生效，走/跑/动作等音效不会生效，播放音效不会生效"
}