{
  "mhwbqlrw655q": "一、通用1.查询对局游玩方式及人数节点功能查询进入对局的理论人数，即参与匹配或开房间的人数和进入对局的方式节点参数参数类型参数名类型说明出参游玩人数整数出参游玩方式枚举分为试玩、房间游玩、匹配游玩2.获取局部变量节点功能可以获取局部变量，也可以设置该局部变量的【初始值】设置【初始值】以后，出参的【值】输出即为输入的【初始值】当出参【局部变量】与执行节点【设置局部变量】的入参【局部变量】连接后，执行节点【设置局部变量】的入参【值】会覆写该查询节点的出参【值】，再次使用【获取局部变量】节点时，出参【值】为覆写后的值节点参数参数类型参数名类型说明入参初始值泛型可以设置局部变量的初始默认值出参局部变量局部变量存储数据的载体出参值泛型未被覆写时，该值等于初始值，被覆写后，该值等于被覆写后的值二、数学1.查询服务器时区节点功能可以查询服务器的时区节点参数参数类型参数名类型说明出参时区整数2.查询时间戳（UTC+0时区）节点功能可以查询当前的时间戳节点参数参数类型参数名类型说明出参时间戳整数3.获取随机浮点数节点功能获取一个大于等于下限，小于等于上限的随机浮点数。注意该节点生成的随机数包含上下限节点参数参数类型参数名类型说明入参下限浮点数入参上限浮点数出参结果浮点数4.获取随机整数节点功能获取一个大于等于下限，小于等于上限的随机整数。注意该节点生成的随机数包含上下限节点参数参数类型参数名类型说明入参下限整数入参上限整数出参结果整数5.权重随机节点功能输入一组权重组成的权重列表，按照权重随机选择其中的一个序号例如：权重列表为{10，20，66，4}，那么此节点分别由10%、20%、66%、4%的概率输出0、1、2、3节点参数参数类型参数名类型说明入参权重列表整数列表出参权重序号整数6.三维向量：后方节点功能返回(0,0,-1)节点参数参数类型参数名类型说明出参(0,0,-1)三维向量7.三维向量：零向量节点功能返回(0,0,0)节点参数参数类型参数名类型说明出参(0,0,0)三维向量8.三维向量：前方节点功能返回(0,0,1)节点参数参数类型参数名类型说明出参(0,0,1)三维向量9.三维向量：上方节点功能返回(0,1,0)节点参数参数类型参数名类型说明出参(0,1,0)三维向量10.三维向量：下方节点功能返回(0,-1,0)节点参数参数类型参数名类型说明出参(0,-1,0)三维向量11.三维向量：右侧节点功能返回(1,0,0)节点参数参数类型参数名类型说明出参(1,0,0)三维向量12.三维向量：左侧节点功能返回(-1,0,0)节点参数参数类型参数名类型说明出参(-1,0,0)三维向量13.圆周率节点功能返回圆周率π的近似值，约为3.142节点参数参数类型参数名类型说明出参圆周率（π）浮点数三、列表相关1.查找列表并返回值的序号节点功能从列表中查找指定值，并返回列表中该值出现的序号列表例如：目标列表为{1,2,3,2,1}，值为1，返回的序号列表为{0，4}，即1出现在目标列表的序号0和4节点参数参数类型参数名类型说明入参目标列表泛型入参值泛型出参序号列表整数列表未找到则返回空列表2.获取列表对应值节点功能返回列表中指定序号对应的值，序号从0开始节点参数参数类型参数名类型说明入参列表泛型入参序号整数出参值泛型3.获取列表长度节点功能获取列表长度（列表中的元素个数）节点参数参数类型参数名类型说明入参列表泛型出参长度整数4.获取列表最大值节点功能仅对浮点数列表和整数列表有意义，返回列表中的最大值节点参数参数类型参数名类型说明入参列表泛型出参最大值泛型5.获取列表最小值节点功能仅对浮点数列表和整数列表有意义，返回列表中的最小值节点参数参数类型参数名类型说明入参列表泛型出参最小值泛型6.列表是否包含该值节点功能返回列表中是否包含指定值节点参数参数类型参数名类型说明入参列表泛型入参值泛型出参是否包含布尔值四、自定义变量1.查询自定义变量快照节点功能从自定义变量组件快照中，查询指定变量名的值仅可用于【实体销毁时】事件节点参数参数类型参数名类型说明入参自定义变量组件快照自定义变量快照入参变量名字符串出参变量值泛型2.获取节点图变量节点功能获取当前节点图的指定节点图变量的值如果变量不存在，则返回类型的默认值节点参数参数类型参数名类型说明入参变量名字符串出参变量值泛型3.获取自定义变量节点功能获取目标实体的指定自定义变量的值如果变量不存在，则返回类型的默认值节点参数参数类型参数名类型说明入参目标实体实体入参变量名字符串出参变量值泛型五、预设状态1.获取预设状态节点功能获取目标实体的指定预设状态的预设状态值。如果该实体没有指定的预设状态，则返回0节点参数参数类型参数名类型说明入参目标实体实体入参预设状态索引整数出参预设状态值整数六、实体相关1.查询角色当前移动速度节点功能仅当角色拥有【监听移动速率】的单位状态效果时，才能查询节点参数参数类型参数名类型说明入参角色实体实体出参当前速度浮点数出参速度向量三维向量2.查询实体是否在场节点功能查询指定实体是否在场注意角色实体即使处于倒下状态，仍然认为在场节点参数参数类型参数名类型说明入参目标实体实体出参是否在场布尔值3.获取场上所有实体节点功能获取当前场上所有在场的实体，该实体列表的数量可能会较大节点参数参数类型参数名类型说明出参实体列表实体列表4.获取场上指定类型实体节点功能获取当前场上指定类型的所有实体，该实体列表的数量可能会较大节点参数参数类型参数名类型说明入参实体类型枚举分为关卡、物件、玩家、角色、造物出参实体列表实体列表5.获取场上指定元件ID的实体节点功能获取当前场上通过指定元件ID创建的所有实体节点参数参数类型参数名类型说明入参元件ID元件ID出参实体列表实体列表6.获取角色属性节点功能获取角色实体的基础属性节点参数参数类型参数名类型说明入参目标实体实体出参等级整数出参当前生命值浮点数出参上限生命值浮点数出参当前攻击力浮点数出参基础攻击力浮点数出参当前防御力浮点数出参基础防御力浮点数出参受打断值上限浮点数出参当前受打断值浮点数出参当前受打断状态枚举7.获取实体进阶属性节点功能获取实体的进阶属性节点参数参数类型参数名类型说明入参目标实体实体出参暴击率浮点数出参暴击伤害浮点数出参治疗加成浮点数出参受治疗加成浮点数出参元素充能效率浮点数出参冷却缩减浮点数出参护盾强效浮点数8.获取实体类型节点功能获取目标实体的实体类型节点参数参数类型参数名类型说明入参目标实体实体出参实体类型枚举分为玩家、角色、关卡、物件、造物9.获取实体位置与旋转节点功能获取目标实体的位置和旋转对玩家实体和关卡实体无意义节点参数参数类型参数名类型说明入参目标实体实体出参位置三维向量出参旋转三维向量10.获取实体向前向量节点功能获取指定实体的向前向量（即该实体本地坐标系下的z轴正方向朝向）节点参数参数类型参数名类型说明入参目标实体实体出参向前向量三维向量11.获取实体向上向量节点功能获取指定实体的向上向量（即该实体本地坐标系下的y轴正方向朝向）节点参数参数类型参数名类型说明入参目标实体实体出参向上向量三维向量12.获取实体向右向量节点功能获取指定实体的向右向量（即该实体本地坐标系下的x轴正方向朝向）节点参数参数类型参数名类型说明入参目标实体实体出参向右向量三维向量13.获取实体拥有的实体列表节点功能获取所有以目标实体为拥有者的实体组成的列表节点参数参数类型参数名类型说明入参目标实体实体出参实体列表实体列表14.获取实体元素属性节点功能获取目标实体的元素相关属性节点参数参数类型参数名类型说明入参目标实体实体出参火元素伤害加成浮点数出参火元素抗性浮点数出参水元素伤害加成浮点数出参水元素抗性浮点数出参草元素伤害加成浮点数出参草元素抗性浮点数出参雷元素伤害加成浮点数出参雷元素抗性浮点数出参风元素伤害加成浮点数出参风元素抗性浮点数出参冰元素伤害加成浮点数出参冰元素抗性浮点数出参岩元素伤害加成浮点数出参岩元素抗性浮点数出参物理伤害加成浮点数出参物理抗性浮点数15.获取物件属性节点功能获取物件的相关基础属性节点参数参数类型参数名类型说明入参物件实体实体出参等级整数出参当前生命值浮点数出参上限生命值浮点数出参当前攻击力浮点数出参基础攻击力浮点数出参当前防御力浮点数出参基础防御力浮点数16.获取拥有者实体节点功能获取指定目标实体的拥有者实体节点参数参数类型参数名类型说明入参目标实体实体出参拥有者实体实体17.获取指定范围的实体列表节点功能在目标实体列表中获取指定球形范围内的实体列表节点参数参数类型参数名类型说明入参目标实体列表实体列表入参中心点三维向量入参半径浮点数出参结果列表实体列表18.获取指定类型的实体列表节点功能在目标实体列表中获取指定类型的实体列表节点参数参数类型参数名类型说明入参目标实体列表实体列表入参实体类型枚举分为玩家、角色、关卡、物件、造物出参结果列表实体列表19.获取指定元件ID的实体列表节点功能在目标实体列表中获取以指定元件ID创建的实体列表节点参数参数类型参数名类型说明入参目标实体列表实体列表入参元件ID元件ID出参结果列表实体列表20.获取指定阵营的实体列表节点功能在目标实体列表中获取归属于某个阵营的实体列表节点参数参数类型参数名类型说明入参目标实体列表实体列表入参阵营阵营出参结果列表实体列表21.获取自身实体节点功能返回该节点图所关联的实体节点参数参数类型参数名类型说明出参自身实体实体22.以实体查询GUID节点功能查询指定实体的GUID节点参数参数类型参数名类型说明入参实体实体出参GUIDGUID23.以GUID查询实体节点功能根据GUID查询实体节点参数参数类型参数名类型说明入参GUIDGUID出参实体实体七、关卡相关1.查询当前环境时间节点功能查询当前的环境时间，范围为[0,24)节点参数参数类型参数名类型说明出参当前环境时间浮点数获取到的值范围为[0,24)出参当前循环天数整数当前已经循环了多少天2.查询游戏已进行时间节点功能查询游戏已进行了多长时间，单位秒节点参数参数类型参数名类型说明出参游戏已进行时间整数八、阵营相关1.查询实体阵营节点功能查询指定实体的阵营节点参数参数类型参数名类型说明入参目标实体实体出参阵营阵营2.查询阵营是否敌对节点功能查询两个阵营是否敌对节点参数参数类型参数名类型说明入参阵营1阵营入参阵营2阵营出参是否敌对布尔值九、玩家与角色相关1.查询玩家角色是否全部倒下节点功能查询玩家的所有角色是否已全部倒下节点参数参数类型参数名类型说明入参玩家实体实体出参结果布尔值2.根据玩家序号获取玩家GUID节点功能根据玩家序号获取玩家GUID，玩家序号即该玩家为玩家几节点参数参数类型参数名类型说明入参玩家序号整数出参玩家GUIDGUID3.根据玩家GUID获取玩家序号节点功能根据玩家GUID获取玩家序号，玩家序号即该玩家为玩家几节点参数参数类型参数名类型说明入参玩家GUIDGUID出参玩家序号整数4.获得玩家客户端输入设备类型节点功能获得玩家的客户端输入设备类型，根据用户界面的映射方式决定节点参数参数类型参数名类型说明入参玩家实体实体出参输入设备类型枚举分为键盘鼠标、手柄、触屏5.获取角色归属的玩家实体节点功能获取角色实体所归属的玩家实体节点参数参数类型参数名类型说明入参角色实体实体出参所属玩家实体实体6.获取玩家复苏耗时节点功能获取指定玩家实体的复苏耗时，单位秒节点参数参数类型参数名类型说明入参玩家实体实体出参时长整数7.获取玩家昵称节点功能获取玩家的昵称节点参数参数类型参数名类型说明入参玩家实体实体出参玩家昵称字符串8.获取玩家剩余复苏次数节点功能获取指定玩家实体的剩余复苏次数节点参数参数类型参数名类型说明入参玩家实体实体出参剩余次数整数9.获取在场玩家实体列表节点功能获取在场所有玩家实体组成的列表节点参数参数类型参数名类型说明出参玩家实体列表实体列表10.获取指定玩家所有角色实体节点功能获取指定玩家实体的所有角色实体列表节点参数参数类型参数名类型说明入参玩家实体实体出参角色实体列表实体列表十、跟随运动器1.获取跟随运动器的目标节点功能获取跟随运动器的目标，可以获取目标实体和实体的GUID节点参数参数类型参数名类型说明入参目标实体实体出参跟随目标实体实体出参跟随目标GUIDGUID十一、全局计时器1.获取全局计时器当前时间节点功能获取目标实体上指定全局计时器的当前时间节点参数参数类型参数名类型说明入参目标实体实体入参计时器名称字符串出参当前时间浮点数十二、界面控件组1.获取玩家当前界面布局节点功能获取指定玩家实体上当前生效的界面布局的索引节点参数参数类型参数名类型说明入参玩家实体实体出参布局索引整数十三、造物1.获取造物当前目标节点功能根据造物当前行为的不同，目标实体也不尽相同。例如当造物在攻击敌方时，造物的目标为敌方指定实体。例如当造物在对友方进行治疗时，造物的目标为友方指定实体。节点参数参数类型参数名类型说明入参造物实体实体运行时的造物实体出参目标实体实体造物当前的智能选取目标实体2.获取造物的经典模式仇恨列表节点功能获取造物的经典仇恨模式的仇恨列表，即仅仇恨配置为【默认类型】时，该节点才会有正确的输出列表节点参数参数类型参数名类型说明入参造物实体实体运行时的造物实体出参仇恨列表实体列表造物当前对哪些实体有仇恨，该列表是无序的3.获取造物属性节点功能获取指定造物的属性节点参数参数类型参数名类型说明入参造物实体实体出参等级整数出参当前生命值浮点数出参上限生命值浮点数出参当前攻击力浮点数出参基础攻击力浮点数出参受打断值上限浮点数出参当前受打断值浮点数出参当前受打断状态枚举十四、职业1.查询玩家职业的等级节点功能查询玩家指定职业的等级节点参数参数类型参数名类型说明入参玩家实体实体入参职业配置ID配置ID出参等级整数2.查询玩家职业节点功能查询玩家当前的职业，会输出该职业的配置ID节点参数参数类型参数名类型说明入参玩家实体实体出参职业配置ID配置ID十五、技能1.查询角色技能节点功能查询角色指定槽位的技能，会输出该技能的配置ID节点参数参数类型参数名类型说明入参角色实体实体入参角色技能槽位枚举出参技能配置ID配置ID十六、单位状态1.查询单位状态的槽位序号列表节点功能查询指定目标实体上特定配置ID的单位状态的所有槽位序号列表节点参数参数类型参数名类型说明入参查询目标实体实体入参单位状态配置ID配置ID出参槽位序号列表整数列表2.查询实体是否具有单位状态节点功能查询指定实体是否具有特定配置ID的单位状态节点参数参数类型参数名类型说明入参目标实体实体入参单位状态配置ID配置ID出参是否具有布尔值3.根据槽位序号查询单位状态层数节点功能查询目标实体指定槽位上的特定单位状态的层数节点参数参数类型参数名类型说明入参查询目标实体实体入参单位状态配置ID配置ID入参槽位序号整数出参层数整数4.根据槽位序号查询单位状态施加者节点功能查询目标实体指定槽位上的特定单位状态的施加者节点参数参数类型参数名类型说明入参查询目标实体实体入参单位状态配置ID配置ID入参槽位序号整数出参施加者实体实体十七、单位标签1.获取单位标签的实体列表节点功能获取在场所有携带该单位标签的实体列表节点参数参数类型参数名类型说明入参单位标签索引整数出参实体列表实体列表2.获取实体单位标签列表节点功能获取目标实体上携带的所有单位标签组成的列表节点参数参数类型参数名类型说明入参目标实体实体出参单位标签列表整数列表十八、自定义仇恨1.查询全局仇恨转移倍率节点功能查询全局仇恨转移倍率，在【关卡设置】中可以配置节点参数参数类型参数名类型说明出参全局仇恨转移倍率浮点数2.查询指定实体的仇恨倍率节点功能查询指定实体的仇恨倍率节点参数参数类型参数名类型说明入参查询目标实体出参仇恨倍率浮点数3.查询指定实体的仇恨值节点功能查询目标实体在仇恨拥有者上的仇恨值节点参数参数类型参数名类型说明入参查询目标实体入参仇恨拥有者实体出参仇恨值整数4.查询指定实体是否已入战节点功能查询指定实体是否已经入战节点参数参数类型参数名类型说明入参查询目标实体出参是否入战布尔值5.获取目标所在仇恨列表的拥有者列表节点功能查询指定目标实体在哪些实体的仇恨列表中节点参数参数类型参数名类型说明入参查询目标实体出参仇恨拥有者列表实体列表6.获取以目标为仇恨目标的拥有者列表节点功能查询哪些实体以目标实体为仇恨目标节点参数参数类型参数名类型说明入参目标实体实体出参仇恨拥有者列表实体列表7.获取指定实体的仇恨列表节点功能获取指定实体的仇恨列表节点参数参数类型参数名类型说明入参目标实体实体出参仇恨列表实体列表8.获取指定实体的仇恨目标节点功能获取指定实体的仇恨目标节点参数参数类型参数名类型说明入参仇恨拥有者实体出参仇恨目标实体十九、全局路径1.获取指定路径点信息节点功能查询指定路径的特定路点信息节点参数参数类型参数名类型说明入参路径索引整数入参路径路点序号整数出参路点位置三维向量出参路点朝向三维向量二十、预设点1.以单位标签获取预设点位列表节点功能根据单位标签索引查询所有携带该单位标签的预设点位列表，输出值为该预设点位的索引节点参数参数类型参数名类型说明入参单位标签索引整数出参点位索引列表整数列表2.查询预设点位置旋转节点功能查询指定预设点的位置和旋转节点参数参数类型参数名类型说明入参点位索引整数出参位置三维向量出参旋转三维向量二十一、关卡结算1.获取玩家结算成功状态节点功能获取玩家结算成功状态节点参数参数类型参数名类型说明入参玩家实体实体出参结算状态枚举分为未定、胜利、失败2.获取玩家结算排名数值节点功能获取指定玩家实体结算的排名数值节点参数参数类型参数名类型说明入参玩家实体实体出参排名数值整数3.获取阵营结算成功状态节点功能获取阵营结算成功状态节点参数参数类型参数名类型说明入参阵营阵营出参结算状态枚举分为未定、胜利、失败4.获取阵营结算排名数值节点功能获取指定阵营结算的排名数值节点参数参数类型参数名类型说明入参阵营阵营出参排名数值整数二十二、字典1.查询字典是否包含特定键节点功能查询指定字典是否包含特定的键节点参数参数类型参数名类型说明入参字典泛型入参键泛型出参是否包含布尔值2.查询字典是否包含特定值节点功能查询指定字典是否包含特定的值节点参数参数类型参数名类型说明入参字典泛型入参值泛型出参是否包含布尔值3.查询字典长度节点功能查询字典中键值对的数量节点参数参数类型参数名类型说明入参字典泛型出参长度整数4.以键查询字典值节点功能根据键查询字典中对应的值，如果键不存在，则返回类型默认值节点参数参数类型参数名类型说明入参字典泛型入参键泛型出参值泛型5.获取字典中键组成的列表节点功能获取字典中所有键组成的列表。由于字典中键值对是无序排列的，所以取出的键列表也不一定按照其插入顺序排列节点参数参数类型参数名类型说明入参字典泛型出参键列表泛型6.获取字典中值组成的列表节点功能获取字典中所有值组成的列表。由于字典中键值对是无序排列的，所以取出的值列表也不一定按照其插入顺序排列节点参数参数类型参数名类型说明入参字典泛型出参值列表泛型二十三、商店1.查询背包商店商品出售信息节点功能查询背包商店种特定商品的出售信息节点参数参数类型参数名类型说明入参商店归属者实体实体入参商店序号整数入参道具配置ID配置ID出参出售货币字典字典出参排序优先级整数出参是否可出售布尔值2.查询背包商店物品出售列表节点功能查询背包商店物品出售列表节点参数参数类型参数名类型说明入参商店归属者实体实体入参商店序号整数出参道具配置ID列表配置ID列表3.查询商店收购物品列表节点功能查询商店收购物品列表节点参数参数类型参数名类型说明入参商店归属者实体实体入参商店序号整数出参道具配置ID列表配置ID列表4.查询商店物品收购信息节点功能查询商店特定物品的收购信息节点参数参数类型参数名类型说明入参商店归属者实体实体入参商店序号整数入参道具配置ID配置ID出参收购货币字典字典出参是否可收购布尔值5.查询自定义商店商品出售列表节点功能查询自定义商店商品出售列表，出参为商品序号组成的列表节点参数参数类型参数名类型说明入参商店归属者实体实体入参商店序号整数出参商品序号列表整数列表6.查询自定义商店商品出售信息节点功能查询自定义商店特定商品的出售信息节点参数参数类型参数名类型说明入参商店归属者实体实体入参商店序号整数入参商品序号整数出参道具配置ID配置ID出参出售货币字典字典出参所属页签序号整数出参是否限购布尔值出参限购数量整数出参排序优先级整数出参是否可出售布尔值二十四、装备1.查询装备标签列表节点功能查询该装备实例的所有标签组成的列表节点参数参数类型参数名类型说明入参装备索引整数出参标签列表配置ID列表2.根据装备索引查询装备配置ID节点功能根据装备索引查询装备配置ID，装备实例的索引可以在【装备初始化】事件中获取到节点参数参数类型参数名类型说明入参装备索引整数出参装备配置ID配置ID3.获取装备词条列表节点功能获取该装备实例的所有词条组成的列表装备初始化时，词条的数值会发生随机，所以装备实例上的装备词条也会生成对应的实例，故数据类型为整数而不是配置ID节点参数参数类型参数名类型说明入参装备索引整数出参装备词条列表整数列表4.获取装备词条配置ID节点功能根据装备实例上装备词条的序号获取该词条的配置ID节点参数参数类型参数名类型说明入参装备索引整数入参词条序号整数出参词条配置ID配置ID5.获取装备词条数值节点功能获取装备实例上对应序号词条的数值节点参数参数类型参数名类型说明入参装备索引整数入参词条序号整数出参装备数值浮点数二十五、道具1.获取背包道具数量节点功能获取背包内特定配置ID的道具数量节点参数参数类型参数名类型说明入参背包持有者实体实体入参道具配置ID配置ID出参道具数量整数2.获取背包货币数量节点功能获取背包内特定配置ID的货币数量节点参数参数类型参数名类型说明入参背包持有者实体实体入参货币配置ID配置ID出参资源数量整数3.获取背包容量节点功能获取背包容量节点参数参数类型参数名类型说明入参背包持有者实体实体出参背包容量整数4.获取背包所有货币节点功能获取背包所有货币，包括货币类型和对应的数量节点参数参数类型参数名类型说明入参背包持有者实体实体出参货币字典字典5.获取背包所有基础道具节点功能获取背包所有基础道具，包括道具类型和对应的数量节点参数参数类型参数名类型说明入参背包持有者实体实体出参基础道具字典字典6.获取背包所有装备节点功能获取背包所有装备，出参为所有装备索引组成的列表节点参数参数类型参数名类型说明入参背包持有者实体实体出参装备索引列表整数列表7.获取掉落物组件道具数量节点功能获取掉落物元件上掉落物组件中特定配置ID的道具数量节点参数参数类型参数名类型说明入参掉落物实体实体入参道具配置ID配置ID出参道具数量整数8.获取掉落物组件货币数量节点功能获取掉落物元件上掉落物组件中特定配置ID的货币数量节点参数参数类型参数名类型说明入参掉落物实体实体入参货币配置ID配置ID出参货币数量整数9.获取掉落物组件所有装备节点功能获取掉落物元件上掉落物组件中的所有装备节点参数参数类型参数名类型说明入参掉落物实体实体出参装备索引列表整数列表10.获取掉落物组件所有道具节点功能获取掉落物元件上掉落物组件中的所有道具节点参数参数类型参数名类型说明入参掉落者实体实体出参道具字典字典11.获取掉落物组件所有货币节点功能获取掉落物元件上掉落物组件中的所有货币节点参数参数类型参数名类型说明入参掉落者实体实体出参货币字典字典二十六、碰撞触发器1.获取碰撞触发器内所有实体节点功能获取目标实体上碰撞触发器组件中特定序号对应的碰撞触发器内的所有实体节点参数参数类型参数名类型说明入参目标实体实体入参触发器序号整数出参实体列表实体列表二十七、小地图标识组件1.查询指定小地图标识信息节点功能查询目标实体上小地图标识组件中特定序号对应的小地图标识的信息节点参数参数类型参数名类型说明入参目标实体实体运行时的实体入参小地图标识序号整数要查询的指定小地图标识的序号出参生效状态布尔值查询的小地图标识的生效状态出参可见标识的玩家列表实体列表返回可见该标识的玩家列表出参追踪标识的玩家列表实体列表返回追踪该标识的玩家列表2.获取实体的小地图标识状态节点功能查询实体当前小地图标识的配置及生效情况节点参数参数类型参数名类型说明入参目标实体实体运行时的实体出参全量小地图标识序号列表整数列表该实体的所有小地图标识枚举列表出参生效的小地图标识序号列表整数列表该实体的所有生效小地图标识枚举列表出参未生效的小地图标识序号列表整数列表该实体的所有未生效小地图标识枚举列表二十八、造物巡逻1.获取当前造物的巡逻模板节点功能获取指定造物实体的巡逻模板信息节点参数参数类型参数名类型说明入参造物实体实体运行时的造物实体出参巡逻模板序号整数造物当前生效的巡逻模板序号出参路径索引整数造物当前生效的巡逻模板引用的路径索引出参目标路点序号整数造物即将前往的路点序号二十九、成就1.查询成就是否完成节点功能查询目标实体上特定序号对应的成就是否完成节点参数参数类型参数名类型说明入参目标实体实体入参成就序号整数出参是否完成布尔值三十、扫描标签1.获取当前生效的扫描标签配置ID节点功能获取目标实体上当前生效的扫描标签的配置ID节点参数参数类型参数名类型说明入参目标实体实体出参扫描标签配置ID配置ID三十一、段位1.获取玩家段位变化分数节点功能获取玩家实体在不同结算状态下段位的变化分数节点参数参数类型参数名类型说明入参玩家实体实体入参结算状态枚举出参分数整数2.获取玩家段位信息节点功能获取玩家段位相关信息节点参数参数类型参数名类型说明入参玩家实体实体出参玩家段位总分整数出参玩家连胜次数整数出参玩家连败次数整数出参玩家连续逃跑次数整数3.获取玩家逃跑合法性节点功能获取玩家逃跑合法性节点参数参数类型参数名类型说明入参玩家实体实体出参是否合法布尔值三十二、实体布设组1.查询当前激活的实体布设组列表节点功能查询当前关卡激活的实体布设组组成的列表节点参数参数类型参数名类型说明出参实体布设组索引列表整数列表三十二、奇域礼盒相关1.查询对应礼盒数量节点功能查询玩家实体上指定礼盒的数量节点参数参数类型参数名类型说明出参玩家实体实体出参礼盒索引整数入参数量整数2.查询对应礼盒消耗数量节点功能查询玩家实体上指定礼盒的消耗数量节点参数参数类型参数名类型说明出参玩家实体实体出参礼盒索引整数入参数量整数"
}